src/Catalogs/КаталогПредметовСнабжения/КаталогПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КаталогПредметовСнабжения</name>
  <attributes>
    <name>НомерОСК</name>
    <comment>Номер в каталоге ОСК</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обозначение</name>
    <comment>№ чертежа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеТранслитированное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УтвержденноеНаименование</name>
    <comment>Утвержденное наименование на русском</comment>
    <type>
      <types>CatalogRef.УтвержденныеНаименованияПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>СамостоятельнаяПоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНаПоставку</name>
    <comment>ТУ, ГОСТ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>CatalogRef.ТипДокументацииДляИзготовленияИПоставкиПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>NSN</name>
    <comment>Номер по системе кодификации НАТО</comment>
    <type>
      <types>String</types>
      <types>CatalogRef.ПредметыСнабженияНАТО</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕКПС</name>
    <type>
      <types>CatalogRef.ЕКПС</types>
    </type>
  </attributes>
  <attributes>
    <name>INCAT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурныйНомерВМФ</name>
    <comment>Номер по базе Юпитер-СТО</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПД2</name>
    <type>
      <types>CatalogRef.ОКПД2</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.ТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПрошивки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрошивки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗаписейСправочниковИКаталогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодСнятияСПроизводства</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаУпаковкиТранспортировкиХранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоСтруктуре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шифр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФНН</name>
    <comment>Федеральный номенклатурный номер</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШифрТранслитированный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзготовителиИПоставщики</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Разработчик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изготовитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокиИзготовления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПроизводства</name>
      <type>
        <types>CatalogRef.СостоянияПроизводстваПС</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗамены</name>
      <type>
        <types>CatalogRef.ТипыЗаменыПредметаСнабженияАналогом</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Характеристики</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтображениеДляЗаказчика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеИзКСУНСИ</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/СпецификацииПредметовСнабжения/СпецификацииПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпецификацииПредметовСнабжения</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерПозиции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>CatalogRef.РазделыСпецификацииЗИП</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеСНК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВыбораДляЗИП</name>
    <type>
      <types>CatalogRef.ПричиныВыбораПредметаСнабженияДляЗИП</types>
    </type>
  </attributes>
  <attributes>
    <name>УказательНаЭлементСхемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Взаимозаменяемость</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакПодбора</name>
    <type>
      <types>CatalogRef.ПризнакиПодбораИлиИзготовленияПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеЗаготовки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СоставляющаяЧасть</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗИП</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/КаталогПредметовСнабжения/Forms/ФормаПозицииСостава/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("НомерПозиции", НомерПозиции); //++ 16.05.2018 Веденеев П.
	Параметры.Свойство("СоставляющаяЧасть", СоставляющаяЧасть);
	Параметры.Свойство("ЗИП", ЗИП);
	Параметры.Свойство("Тип", Тип);
	Параметры.Свойство("Количество", Количество);
	Параметры.Свойство("ОбозначениеСНК", ОбозначениеСНК);
	Параметры.Свойство("ПричинаВыбораДляЗИП", ПричинаВыбораДляЗИП);
	Параметры.Свойство("УказательНаЭлементСхемы", УказательНаЭлементСхемы);
	Параметры.Свойство("Взаимозаменяемость", Взаимозаменяемость);
	Параметры.Свойство("ПризнакПодбора", ПризнакПодбора);
	Параметры.Свойство("ОбозначениеЗаготовки", ОбозначениеЗаготовки);
	Параметры.Свойство("СведенияОбИзменениях", СведенияОбИзменениях);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	РезультатПроверкиЗаполненияРеквизитов = ПроверитьЗаполнениеРеквизитов();
	
	Если РезультатПроверкиЗаполненияРеквизитов.ЕстьЗамечания Тогда
	
		Отказ = Истина;
		Сообщить(РезультатПроверкиЗаполненияРеквизитов.Описание);
		Возврат;
	
	КонецЕсли;
	
	СтруктураЗакрытия = Новый Структура();
	
	СтруктураЗакрытия.Вставить("НомерПозиции", НомерПозиции); //++ 16.05.2018 Веденеев П.
	СтруктураЗакрытия.Вставить("СоставляющаяЧасть", СоставляющаяЧасть);
	СтруктураЗакрытия.Вставить("ЗИП", ЗИП);
	СтруктураЗакрытия.Вставить("Тип", Тип);
	СтруктураЗакрытия.Вставить("Количество", Количество);
	СтруктураЗакрытия.Вставить("ОбозначениеСНК", ОбозначениеСНК);
	СтруктураЗакрытия.Вставить("ПричинаВыбораДляЗИП", ПричинаВыбораДляЗИП);
	СтруктураЗакрытия.Вставить("УказательНаЭлементСхемы", УказательНаЭлементСхемы);
	СтруктураЗакрытия.Вставить("Взаимозаменяемость", Взаимозаменяемость);
	СтруктураЗакрытия.Вставить("ПризнакПодбора", ПризнакПодбора);
	СтруктураЗакрытия.Вставить("ОбозначениеЗаготовки", ОбозначениеЗаготовки);
	СтруктураЗакрытия.Вставить("СведенияОбИзменениях", СведенияОбИзменениях);
	СтруктураЗакрытия.Вставить("Обозначение", ПолучитьОбозначение(СоставляющаяЧасть));
	
	Закрыть(СтруктураЗакрытия);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОбозначение(ПредметСнабжения)
	
	Возврат ПредметСнабжения.Обозначение;
	
КонецФункции

&НаКлиенте
Функция ПроверитьЗаполнениеРеквизитов()
	
	Результат = Новый Структура("ЕстьЗамечания, Описание", Ложь, "");

	МассивЗамечаний = Новый Массив;
	
	Если Не ЗначениеЗаполнено(СоставляющаяЧасть) Тогда
	
		МассивЗамечаний.Добавить("Не заполнена составная часть.");
		МассивЗамечаний.Добавить(Символы.ПС);	
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Тип) Тогда
	
		МассивЗамечаний.Добавить("Не заполнен тип.");
		МассивЗамечаний.Добавить(Символы.ПС);	
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Количество) Тогда
	
		МассивЗамечаний.Добавить("Не заполнено количество.");
		МассивЗамечаний.Добавить(Символы.ПС);	
		
	КонецЕсли;
	
	// ++ 30.08.2018 14:22:47 Базунов Д.А. Задача: 
	//Если Не ЗначениеЗаполнено(ПричинаВыбораДляЗИП) Тогда
	//
	//	МассивЗамечаний.Добавить("Не заполнена причина выбора для ЗИП.");
	//	МассивЗамечаний.Добавить(Символы.ПС);	
	//	
	//КонецЕсли;			
	// -- 30.08.2018 14:22:47 Базунов Д.А. Задача:
	
	Если МассивЗамечаний.Количество() > 0 Тогда
		
		МассивЗамечаний.Удалить(МассивЗамечаний.Количество() - 1);
		Результат.Описание = СтрСоединить(МассивЗамечаний);
		Результат.ЕстьЗамечания = Истина;
		 
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ПроверитьЗаполнениеРеквизитов()

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗИППриИзменении(Элемент)
	
	//++ 19.02.2018 Веденеев П. //если установлен флаг ЗИП, но предмет снабжения имеет спецификацию - запрашиваем подтверждение действия
	Если ЗИП И ИмеетсяСпецификация(СоставляющаяЧасть) Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПриИзмененииЗИП", ЭтаФорма), 
			"Спецификация элемента будет удалена из структуры заказа (включая данные о количестве). Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ПриИзмененииЗИП(КодВозвратаДиалога.Да, Неопределено);
		
	КонецЕсли;
	//-- 19.02.2018 Веденеев П. //если установлен флаг ЗИП, но предмет снабжения имеет спецификацию - запрашиваем подтверждение действия
	
КонецПроцедуры

//++ 19.02.2018 Веденеев П. //если установлен флаг ЗИП, но предмет снабжения имеет спецификацию - запрашиваем подтверждение действия
&НаСервереБезКонтекста
Функция ИмеетсяСпецификация(ПредметСнабжения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпецификацииПредметовСнабжения.СоставляющаяЧасть КАК СоставляющаяЧасть
	|ИЗ
	|	РегистрСведений.СпецификацииПредметовСнабжения КАК СпецификацииПредметовСнабжения
	|ГДЕ
	|	СпецификацииПредметовСнабжения.ПредметСнабжения = &ПредметСнабжения";
	Запрос.УстановитьПараметр("ПредметСнабжения", ПредметСнабжения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииЗИП(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		
		ЗИП = Ложь;
		Сообщить("Действие отменено!");
		Возврат;
		
	КонецЕсли;	
	
КонецПроцедуры
//-- 19.02.2018 Веденеев П. //если установлен флаг ЗИП, но предмет снабжения имеет спецификацию - запрашиваем подтверждение действия
